{
  "name": "The Best Chicken and Rice",
  "description": "Avax is Cookin",
  "image": "ipfs://Qmbj551eCjEJiK7wCRapHTQSpewvVFdyXuaRt1F625jcFU",
  "attributes": [
    {
      "trait_type": "Category",
      "value": "Dinner"
    },
    {
      "trait_type": "Preparation Time",
      "value": "55 minutes"
    },
    {
      "trait_type": "Difficulty Level",
      "value": "Easy"
    },
    {
      "trait_type": "Kid-Specific",
      "value": "No"
    },
    {
      "trait_type": "canola oil",
      "value": "2 tablespoons"
    },
    {
      "trait_type": "bone-in, skin on chicken thighs (about 6 ounces each)  ",
      "value": "4 to 6"
    },
    {
      "trait_type": "paprika",
      "value": "1/2 teaspoon"
    },
    {
      "trait_type": "Kosher salt and freshly ground black pepper",
      "value": "a bit"
    },
    {
      "trait_type": "medium carrots (about 12 ounces), sliced into 1/4-inch rounds",
      "value": "4"
    },
    {
      "trait_type": "stalks celery (about 9 ounces), sliced 1/4-inch thick ",
      "value": "3"
    },
    {
      "trait_type": "large shallots (about 4 ounces), finely diced ",
      "value": "2"
    },
    {
      "trait_type": "cloves garlic, minced ",
      "value": "2"
    },
    {
      "trait_type": "fresh thyme leaves, chopped ",
      "value": "1 tablespoon"
    },
    {
      "trait_type": "fresh oregano leaves, chopped",
      "value": "1 tablespoon"
    },
    {
      "trait_type": "finely grated lemon zest plus 1 tablespoon lemon juice ",
      "value": "2 teaspoons"
    },
    {
      "trait_type": "long-grain rice ",
      "value": "1 cup"
    },
    {
      "trait_type": "low-sodium chicken stock ",
      "value": "2 cups"
    },
    {
      "trait_type": "chopped fresh chives",
      "value": "1 tablespoon"
    },
    {
      "trait_type": "Method",
      "value": "Heat 1 tablespoon of the oil in a large skillet over medium-high heat. Toss the chicken with the paprika, 1 teaspoon salt and a few grinds of pepper in a large bowl. Place the chicken skin-side down in the skillet and cook undisturbed until the skin is golden but not too dark, 4 to 5 minutes. Remove the chicken to a plate using a metal spatula and add the remaining 1 tablespoon oil to the skillet.\nAdd the carrots, celery and shallots to the skillet and cook, stirring occasionally, until softened but not yet turning golden, 4 to 5 minutes. Stir in the garlic, thyme, oregano, lemon zest, lemon juice, 1/2 teaspoon salt and a few grinds of pepper and cook just until you begin to smell the garlic, about 1 minute. Stir in the rice and cook undisturbed until lightly toasted, about 2 minutes. Pour in the stock, add 1/2 teaspoon salt and stir to combine, then add the chicken thighs back to the pan, skin-side up. Bring the liquid to a boil then cover, reduce the heat to a simmer and cook until the rice is tender and the chicken is cooked through, 15 to 20 minutes. Meanwhile, preheat the broiler.  \nRemove the lid from the pan and broil until the chicken skin is crispy and golden, 2 to 3 minutes. Sprinkle with the chives."
    }
  ]
}