{
  "name": "Luigi's Lasagna Pasta Noodles",
  "description": "Avax is Cookin",
  "image": "ipfs://QmPXnJtgkHTdKD2MCrE4BshQx7rv3EuYLU9UxiFP9TB9bk",
  "attributes": [
    {
      "trait_type": "Category",
      "value": "Dinner"
    },
    {
      "trait_type": "Difficulty Level",
      "value": "Medium"
    },
    {
      "trait_type": "Region",
      "value": "Europe"
    },
    {
      "trait_type": "Cuisine Type",
      "value": "Italian"
    },
    {
      "trait_type": "Kid-Specific",
      "value": "No"
    },
    {
      "trait_type": "Contributor",
      "value": "Luigi Parmigiano"
    },
    {
      "trait_type": "Nut-Free",
      "value": "true"
    },
    {
      "trait_type": "Shellfish-Free",
      "value": "true"
    },
    {
      "trait_type": "Soy-Free",
      "value": "true"
    },
    {
      "trait_type": "all-purpose flour",
      "value": "2 cups"
    },
    {
      "trait_type": "large eggs",
      "value": "3"
    },
    {
      "trait_type": "olive oil",
      "value": "1 tablespoon"
    },
    {
      "trait_type": "salt",
      "value": "1/2 teaspoon"
    },
    {
      "trait_type": "water (if needed)",
      "value": "1-2 tablespoons"
    },
    {
      "trait_type": "Community Tag",
      "value": "Cozyverse"
    },
    {
      "trait_type": "Method",
      "value": "Instructions:\nPrepare the Dough:\n\nOn a clean surface, make a mound with the flour and create a well in the center.\nCrack the eggs into the well, add the olive oil and salt.\nUsing a fork, gently beat the eggs and gradually incorporate the flour from the edges of the well into the egg mixture.\nKnead the Dough:\n\nOnce the mixture becomes too thick to mix with a fork, use your hands to continue incorporating the flour.\nKnead the dough for about 10 minutes, until it becomes smooth and elastic. If the dough is too dry, add water, one tablespoon at a time. If it’s too sticky, add a little more flour.\nRest the Dough:\n\nWrap the dough in plastic wrap and let it rest at room temperature for at least 30 minutes.\nRoll Out the Dough:\n\nDivide the dough into manageable pieces.\nUsing a rolling pin or a pasta machine, roll each piece of dough into thin sheets, about 1/16 inch thick.\nCut the Noodles:\n\nCut the rolled-out dough into long strips about 3-4 inches wide for lasagna noodles.\nLay the noodles on a floured surface or a clean kitchen towel, making sure they do not overlap.\nCook the Noodles:\n\nBring a large pot of salted water to a boil.\nCook the noodles in batches for about 2-3 minutes or until they are al dente.\nRemove with a slotted spoon and place them in a bowl of ice water to stop the cooking process.\nDrain and lay them out on a clean kitchen towel to dry slightly before assembling your lasagna.\n\nYou family gonna love you a'so much more when they eat the Luigi's Classico Lasagna!  They gonna tell you \"this the best Luigi's Classico Lasagna! May I have some more, ti prego\""
    }
  ]
}