{
  "name": "Yetta's Puff Pastry Recipe",
  "description": "Avax is Cookin",
  "image": "ipfs://QmbdBXzze85MopL8JcxvUHfEZfcrbJdCJsnwbgsrx81Wqb",
  "attributes": [
    {
      "trait_type": "Category",
      "value": "Snacks"
    },
    {
      "trait_type": "Preparation Time",
      "value": "60 minutes"
    },
    {
      "trait_type": "Difficulty Level",
      "value": "Medium"
    },
    {
      "trait_type": "Region",
      "value": "Europe"
    },
    {
      "trait_type": "Kid-Specific",
      "value": "No"
    },
    {
      "trait_type": "Special Equipment",
      "value": "Baking Essentials"
    },
    {
      "trait_type": "Contributor",
      "value": "Yetta"
    },
    {
      "trait_type": "Nut-Free",
      "value": "true"
    },
    {
      "trait_type": "Shellfish-Free",
      "value": "true"
    },
    {
      "trait_type": "Soy-Free",
      "value": "true"
    },
    {
      "trait_type": "all-purpose flour",
      "value": "2 1/2 cups"
    },
    {
      "trait_type": "salt",
      "value": "1 teaspoon"
    },
    {
      "trait_type": "cold unsalted butter, cut into small cubes",
      "value": "1 cup"
    },
    {
      "trait_type": "cold water",
      "value": "2/3 cup"
    },
    {
      "trait_type": "lemon juice",
      "value": "1 teaspoon"
    },
    {
      "trait_type": "Method",
      "value": "Instructions:\nPrepare the Dough:\n\nIn a large mixing bowl, combine the flour and salt.\nAdd the cold, cubed butter to the bowl. Using a pastry cutter or your fingertips, work the butter into the flour until the mixture resembles coarse crumbs with pea-sized pieces of butter remaining.\nAdd Liquid Ingredients:\n\nIn a small bowl, mix the cold water with the lemon juice.\nGradually add the water mixture to the flour and butter mixture, stirring with a fork until the dough starts to come together.\nForm the Dough:\n\nTurn the dough out onto a lightly floured surface. Knead gently to bring the dough together, being careful not to overwork it.\nShape the dough into a rectangle, wrap it in plastic wrap, and refrigerate for at least 30 minutes.\nRoll and Fold the Dough:\n\nRemove the dough from the refrigerator and roll it out on a lightly floured surface into a long rectangle.\nFold the bottom third of the dough up to the center, then fold the top third down over it, like folding a letter.\nRotate the dough 90 degrees and roll it out again into a long rectangle.\nRepeat the folding process, then wrap the dough in plastic wrap and refrigerate for 30 minutes. Repeat this rolling and folding process 2 more times, chilling the dough for 30 minutes between each fold.\nFinal Chill:\n\nAfter the final fold, wrap the dough in plastic wrap and refrigerate for at least 1 hour or up to overnight.\nUse or Store:\n\nThe puff pastry is now ready to use. You can roll it out and use it in your favorite recipes.\nTo freeze, wrap the dough tightly in plastic wrap and place it in a resealable plastic bag. Freeze for up to 2 months. Thaw in the refrigerator before using.\n(Bubby, these are so easy to fit into any recipe.  Cut them up into little squares and throw em in your freezer)"
    }
  ]
}