{
  "name": "Pho (Vietnamese Noodle Soup)",
  "description": "Avax is Cookin",
  "image": "ipfs://QmdniTJJGEfVSz6MhQzhuJG8u9DtUBLgyB6su4PBaVHejE",
  "attributes": [
    {
      "trait_type": "Category",
      "value": "Dinner"
    },
    {
      "trait_type": "Preparation Time",
      "value": "220 minutes"
    },
    {
      "trait_type": "Serving Size",
      "value": "12"
    },
    {
      "trait_type": "Difficulty Level",
      "value": "Easy"
    },
    {
      "trait_type": "Kid-Specific",
      "value": "No"
    },
    {
      "trait_type": "Contributor",
      "value": "TOH"
    },
    {
      "trait_type": "Gluten-Free",
      "value": "true"
    },
    {
      "trait_type": "Dairy-Free",
      "value": "true"
    },
    {
      "trait_type": "Nut-Free",
      "value": "true"
    },
    {
      "trait_type": "Shellfish-Free",
      "value": "true"
    },
    {
      "trait_type": "Egg-Free",
      "value": "true"
    },
    {
      "trait_type": "DAM TOI (PICKLED GARLIC VINEGAR): ",
      "value": "Below"
    },
    {
      "trait_type": "medium garlic cloves, thinly sliced lengthwise",
      "value": "10"
    },
    {
      "trait_type": "water",
      "value": "2 cups, divided"
    },
    {
      "trait_type": "salt",
      "value": "4 teaspoons, divided"
    },
    {
      "trait_type": "white vinegar",
      "value": "1 cup"
    },
    {
      "trait_type": "Thai chiles",
      "value": "1 to 2"
    },
    {
      "trait_type": "sugar",
      "value": "1 tablespoon"
    },
    {
      "trait_type": "BROTH:",
      "value": "Below"
    },
    {
      "trait_type": "beef leg or knuckle bones (choose ones with lots of marrow)",
      "value": "3.5 pounds"
    },
    {
      "trait_type": "water",
      "value": "3 liters, divided"
    },
    {
      "trait_type": "salt, divided",
      "value": "4 tablespoons, divided"
    },
    {
      "trait_type": "cider vinegar",
      "value": "2 tablespoons"
    },
    {
      "trait_type": "beef top sirloin stea",
      "value": "2-1/2 pounds"
    },
    {
      "trait_type": "fresh beef brisket",
      "value": "2-1/2 pounds"
    },
    {
      "trait_type": "dry white wine",
      "value": "1/4 cup"
    },
    {
      "trait_type": "fresh gingerroot (about 3 ounces), peeled and sliced lengthwise",
      "value": "1 piece"
    },
    {
      "trait_type": "large white onions, left whole, skin on",
      "value": "2"
    },
    {
      "trait_type": "fresh gingerroot (about 3 ounces), left whole, skin on",
      "value": "1 piece"
    },
    {
      "trait_type": "cinnamon sticks (2.5 inches each)",
      "value": "2"
    },
    {
      "trait_type": "star anise",
      "value": "3 whole"
    },
    {
      "trait_type": "cardamom pods",
      "value": "2 large"
    },
    {
      "trait_type": "coriander seeds",
      "value": "1 teaspoon"
    },
    {
      "trait_type": "salt",
      "value": "4-1/2 teaspoons"
    },
    {
      "trait_type": "MSG, optional",
      "value": "1-1/2 teaspoons"
    },
    {
      "trait_type": "rock sugar or granulated sugar",
      "value": "1 teaspoon"
    },
    {
      "trait_type": "TO SERVE:",
      "value": "Below"
    },
    {
      "trait_type": "Banh Pho rice noodles",
      "value": "28 ounces"
    },
    {
      "trait_type": "Table-side Garnishes (Northern Style): Prepared Dam Toi, 1 large onion halved and sliced into strips soaked in ice water, 4 wedged medium limes, 3 sliced green onions, 8 minced Thai chiles",
      "value": "As Needed"
    },
    {
      "trait_type": "Table-side Garnishes (Southern Style): Fresh mung bean sprouts, hoisin sauce, sriracha, lime wedges, Thai chiles and chopped fresh Thai basil, coriander, mint and Culantro (sawtooth herb/Ngo om)",
      "value": "As Needed"
    },
    {
      "trait_type": "Method",
      "value": "For Dam Toi, which is used as a garnish for northern style pho, in a small bowl, combine sliced garlic, 1 cup water and 3 teaspoons salt. Cover and refrigerate overnight; drain. In a small jar, combine sliced garlic and vinegar. Heat remaining 1 cup water until hot; add to jar. Stir in sugar, remaining 1 teaspoon salt and chiles. Cover and let stand at room temperature overnight.\n\nIn a large saucepan, cover beef bones with 2 liters water. Add 2 tablespoons salt and cider vinegar. In another large saucepan, cover boneless beef with remaining 1 liter water, remaining 2 tablespoons salt, wine and sliced ginger. Cover both saucepans and refrigerate 2 hours; drain (discarding ginger from boneless meat). Add enough cold water to each saucepan to cover bones and meat. Bring to a boil over medium-high heat. Boil 3 minutes; drain both saucepans and rinse bones and and boneless beef.\n\nPreheat oven to 425°. In a stockpot, cover bones and boneless beef with enough cold water to cover completely (about 5 liters). Bring to a boil over medium-high heat. Reduce heat; simmer, uncovered, skimming and discarding foam occasionally. Simmer until foam starts to collect more slowly, about 30 minutes.\n\nMeanwhile, arrange whole onion and whole ginger on an ungreased baking sheet. Roast until slightly charred, 10-15 minutes, turning occasionally. Remove and discard charred skins; set aside.\nIn a dry small skillet, toast cinnamon sticks, anise, cardamom pods and coriander over medium heat until aromatic, 1-2 minutes, stirring frequently. Cool. Place spices on a double thickness of cheesecloth. Gather corners of cloth to enclose spices; tie securely with string.\nOnce foam is no longer collecting on surface of broth, add onion and ginger and spice bag. Stir in salt, MSG if desired and rock sugar. Simmer, uncovered, until beef is tender, about 1-1/2 hours. With tongs, remove beef to a large bowl; cool slightly. Wrap beef tightly in foil and refrigerate.\n\nContinue simmering broth, uncovered, until broth is light golden brown and fragrant, 2-5 hours, stirring occasionally and removing any foam that collects on the surface.\n\nTo serve, cook Banh Pho according to package directions; set aside. Remove beef from refrigerator and thinly slice against the grain. For each serving, in a small colander, add an individual portion of noodles and beef. Lower colander into simmering broth until beef and noodles are heated through. Add beef and noodles to a serving bowl. Top with additional broth, about 1 cup. Serve with garnishes as desired."
    }
  ]
}